In [1]:
import pandas as pd

In [2]:
record1 = pd.Series({
    "Name" : "Alice",
    "Class" : "Physics",
    "Score" : 85
})

record2 = pd.Series({
    "Name":"Jack",
    "Class":"Chemistry",
    "Score":82
})

record3 = pd.Series({
    "Name":"Helen",
    "Class" : "Biology",
    "Score":90
})

In [3]:
#entendemos que la diferencia entre un dataframe y una serie es que una serie es un array lineal en cambio un dataframe es practicamente una matriz
df = pd.DataFrame([record1,record2,record3], index=['school1','school2','school1'])
#en donde el metodo head nos devuelve las primeras filas del dataframe
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [4]:
#en donde school1 y school2 son los indices de nuestros valores

In [5]:
#una forma alterna de almacenar valores es usar una lista de diccionarios
students = [
    {
    "Name":"Helen",
    "Class" : "Biology",
    "Score":90
    },
    {
    "Name":"Jack",
    "Class":"Chemistry",
    "Score":82
    },
    {
    "Name" : "Alice",
    "Class" : "Physics",
    "Score" : 85
    }
]

df = pd.DataFrame(students, index=['school1','school2','school1'])
df

          Name      Class  Score
school1  Helen    Biology     90
school2   Jack  Chemistry     82
school1  Alice    Physics     85

In [6]:
#de manera parecida a una serie podemos extraer valores de un dataframe mediente su ubicacion o nombre de columna (iloc - loc)
df.loc['school2']

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [7]:
#tambien debemos tener en cuenta que pueden existir valores q no seran unicos dada la naturaleza de los datos, ademas este resultado
#influira en el tipo resultante del dato siendo asi 
#una serie
print(type(df.loc['school2']))
#un dataframe
print(type(df.loc['school1']))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [8]:
#y si queremos una selection mucho mas exhaustiva de datos podemos usar la siguiente sintaxis
df.loc['school1','Name']

school1    Helen
school1    Alice
Name: Name, dtype: object

In [10]:
#y si queremos una sola columna podemos hacerlo inviertiendo las columnas a filas y las filas a columnas
df.T

       school1    school2  school1
Name     Helen       Jack    Alice
Class  Biology  Chemistry  Physics
Score       90         82       85

In [11]:
#y ahora la consulta resultante para la columna nombre seria 
df.T.loc['Name']

school1    Helen
school2     Jack
school1    Alice
Name: Name, dtype: object

In [13]:
#dado que un dataframe es practicamente una matriz debemos usar una sintaxis parecida a esta para poder obtener 
#los datos que nos interesan como por ejemplo
df.iloc[0][0]

'Helen'

In [15]:
#o usar una busqueda a partir del indice y las columnas de interesa
df.loc['school1']['Name'] #donde school1 es el indice y name la columna de interes

school1    Helen
school1    Alice
Name: Name, dtype: object

In [20]:
#otra forma de recuperar datos es mediante el slicing o corte en donde seleccionamos las filas como si fueran listas
#y cortamos los datos de interes
df.loc[:,['Name','Score']]

          Name  Score
school1  Helen     90
school2   Jack     82
school1  Alice     85

In [22]:
#Ahora veremos la eliminacion de filas mediante el metodo drop, el punto mas importante sobre este metodo es que realmente
#no elimina la fila que nos interesa si no devuelve una vista donde el dato que pasamos como parametro no existe sin afectar
#al dataframe realmente
df.drop('school1')

         Name      Class  Score
school2  Jack  Chemistry     82

In [23]:
#y ahora veamos el dataframe 
df

          Name      Class  Score
school1  Helen    Biology     90
school2   Jack  Chemistry     82
school1  Alice    Physics     85

In [24]:
#y si lo que queremos es realmente elimnar el dataframe podemos usar el segundo parametro que tiene nuestro metodo drop
#que si llega a eliminar la informacion de nuestro dataframe, y el tercer parametro que nos permite eliminar una columna(1) o una fila(1)
copy_df = df.copy()#creamos una copia de seguridad
copy_df.drop('Name', inplace=True, axis=1)#eliminamos la columna name
copy_df

             Class  Score
school1    Biology     90
school2  Chemistry     82
school1    Physics     85

In [25]:
#otro metodo q tambien nos sirve para eliminar una columna es el metodo del
del copy_df['Class']
copy_df

         Score
school1     90
school2     82
school1     85

In [26]:
#finalmente si lo que queremos es aumentar una columna podemos usar la siguiente notacion
df['NuevaCol'] = None
df

          Name      Class  Score NuevaCol
school1  Helen    Biology     90     None
school2   Jack  Chemistry     82     None
school1  Alice    Physics     85     None